preprod/config/config.yml
##CONFIG SECTION##

config:
  tls: 
    rejectUnauthorized: false # DISABLE CERTIFICATE VALIDATION, FOR STAGE AND DEV TESTING ONLY
  http: 
    timeout: 10
    pool: 10 # All HTTP requests from all virtual users will be sent over the same 10 connections, to open and re-use a fixed number of connection
  ensure:
    maxErrorRate: 5

  plugins: # Import plugins
    expect: {}
    fuzzer: {}

  target: 'https://static.tempest.hope.addimedical.netzon.se/api' # baseURL of API

  phases:
    - duration: 1  #Duration of test will be running
      arrivalRate: 1 #Arrival of new virtual user per second (average virtual users)
      name: "Normal Load" #Name of phase. Can set multiple phases
    
    ##- pause: 1 #Pauses for 1 second(s), no virtual users created in this duration


  # SETUP VARIABLES HERE
  variables:

    ## Add careplan variables
    patientGUID:
      - "69bfb380-da59-4ae6-b083-0fedbd59c285"
    healthIssue:
      - "I64-"
    careplanName:
      - "Any careplan name (Artillery)"

    ## Add recurring activities variables
    careplanGUID:
      - "d3c5b0cf-17b1-48fb-a820-58db89c23fd7"
    activityCode:
      - "HT.Weight"
    repeatCount: ## Recurring Activity - number of times recurring activity is created
      - "1" 
    period: ## Recurring Activity - Interval per day //// This repeatCount = 10 and period = 1 value will create 1 recurring activity each day for 10 days
      - "1"
    calendarStart:
      - "Wed, 1 Jan 2020 16:00:00 GMT" ## Please follow the format e.g. Sat, 15 Feb 2020 16:00:00 GMT
    calendarEnd:
      - "Thu, 31 Dec 2020 16:00:00 GMT" ## Please follow the format e.g. Sat, 20 Jun 2020 16:00:00 GMT

    ## POST Eform Instance
    activityGUID: "5b53c13d-8fd7-4e93-8d2c-be445398f0c4" 

    ## GET Eform Instance
    eformInstanceGUID: "033b6cd2-6173-43a9-80ed-2348ae53da3d" 

    max_items: 
      - "10000"

  defaults:
    headers: #Setup required authorization here, if there is any, before starting to execute load test
      ServiceAccountAuthorization: 'bearer STAGINGMH'
      Authorization: 'bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJodHRwOi8vc2NoZW1hcy54bWxzb2FwLm9yZy93cy8yMDA1LzA1L2lkZW50aXR5L2NsYWltcy9hdXRoZW50aWNhdGlvbiI6IntcInN0YXR1c1wiOjAsXCJwcmluY2lhbFwiOm51bGwsXCJzZXNzaW9uXCI6e1wic2Vzc2lvbklkXCI6XCJlMzUwMzMxOC1lNGU3LTRiMDMtOTY0OS04OWZjNWYzMDlhNTFcIixcInVzZXJSZWZcIjp7XCJndWlkXCI6XCIzNTQzZGFmZC1lZjYyLTQ2ZTEtYmYyOC0xNjlhY2M3YTg0YmRcIixcInZlcnNpb25cIjpudWxsLFwidGl0bGVcIjpcIlRlY2ggU3Vwb3J0XCJ9LFwidXNlcklkXCI6e1widHlwZVwiOntcImNvZGVcIjpcIlwiLFwic3lzdGVtXCI6XCJcIn0sXCJzeXN0ZW1cIjpcIlwiLFwidmFsdWVcIjpcIlNVUFBPUlQwMVwifSxcInJvbGVcIjoxLFwibG9naW5NZXRob2RcIjp7XCJjb2RlXCI6XCJUb2tlblwiLFwic3lzdGVtXCI6XCJIT1BFLkxvZ2luTWV0aG9kXCJ9LFwiZXhwaXJlc1wiOlwiMjAyMy0wMi0yN1QwODozMDozOS4wMTk1NTgxWlwiLFwiY29tbWlzc2lvblwiOntcImlkXCI6bnVsbCxcImF0dHJpYnV0ZXNcIjpbe1wibmFtZVwiOlwiUm9sZVwiLFwidmFsdWVcIjpcIlByYWN0aXRpb25lclwifV19LFwib3JnUmVmXCI6e1wiZ3VpZFwiOlwiY2UzNGM3NDUtZmE2OC00ZjA0LWIxYmYtZGJlNTFlMTk5MzA4XCIsXCJ2ZXJzaW9uXCI6bnVsbCxcInRpdGxlXCI6XCJTw7ZkcmEgw4RsdnNib3JncyBzanVraHVzXCJ9LFwib3JnSWRcIjp7XCJ0eXBlXCI6e1wiY29kZVwiOlwiXCIsXCJzeXN0ZW1cIjpcIlwifSxcInN5c3RlbVwiOlwiXCIsXCJ2YWx1ZVwiOlwiVkdSMDA5XCJ9LFwiaGVhbHRoQ2FyZVByb3ZpZGVySWRcIjp7XCJ0eXBlXCI6e1wiY29kZVwiOlwiXCIsXCJzeXN0ZW1cIjpcIlwifSxcInN5c3RlbVwiOlwiXCIsXCJ2YWx1ZVwiOlwiVkdSXCJ9LFwiaGVhbHRoQ2FyZVVuaXRJZFwiOm51bGwsXCJhY2NvdW50XCI6XCJTVEFHSU5HTUhcIixcInRpbWV6b25lXCI6XCIwMDowMDowMFwiLFwiZXh0ZW5zaW9uXCI6W3tcIm5hbWVcIjpcIlwiLFwidmFsdWVcIjpcIlwifSx7XCJuYW1lXCI6XCJIT1BFLkFsaWFzXCIsXCJ2YWx1ZVwiOlwiVFNcIn0se1wibmFtZVwiOlwiSE9QRS5DaGF0XCIsXCJ2YWx1ZVwiOlwiWVwifSx7XCJuYW1lXCI6XCJIT1BFLlByb2Zlc3Npb25hbFRpdGxlXCIsXCJ2YWx1ZVwiOlwiU3VwcG9ydFwifV19LFwic2Vzc2lvbktleVwiOlwiT1M4bmV2QzQrR3dUNmJwSnpCaHc1anIzbVhTd05CalhSWnhpWVJtNzQrYUFoN1JPbncybDcxYjRuUjlxSWpWcTlDUEx0SUtlRDJQN2tJNlRnR3VWbGc9PVwifSIsIm5iZiI6MTU5MTE3MzAzOSwiZXhwIjozNDgzMzMzMDM5LCJpYXQiOjE1OTExNzMwMzl9.rpMrGNT3YskUVrGLzUkSLCRbjz_Sb-JLmrrx7GS3Gnk'
      Accept-Language: 'en'
      accept: application/json
      Content-Type: application/json-patch+json
    

## END OF CONFIG